{
    "me": {
        "certification": {
            "label": "Certificaciones"
        },
        "contact": {
            "label": "Contacto"
        },
        "skill": {
            "label": "Habilidades"
        },
        "work": {
            "label": "Trabajos",
            "uci": {
                "label": "Universidad de las Ciencias Informáticas",
                "description": "La Universidad de las Ciencias Informáticas es un centro de investigación universitario cubano con sede en el barrio de Wajay, municipio de Boyeros, La Habana. \nLa UCI tiene un currículo particular entre otras universidades del país, los estudiantes siguen el principio de vincular el trabajo y el estudio, lo que pone énfasis en la producción como parte del proceso de aprendizaje, a partir del segundo o tercer año de estudios los estudiantes pueden vincularse a actividades productivas. proyectos que contribuyen a la economía.",
                "apklis": {
                    "description": "Apklis también conocida como la Play Store cubana, es una tienda online de aplicaciones desarrollada por la UCI para dispositivos Android.\nTiene su versión web y tambien su versión de aplicación para android.\nEstá diseñada para descargar todas las aplicaciones cubanas y las más populares del resto del mundo utilizando de la red de datos de ETECSA, Nauta u otro medio de navegación nacional.\nCuenta con un amplio catálogo de juegos, así como aplicaciones útiles, de las redes sociales, editores de fotografía, entre otras.",
                    "frontenddev": {
                        "label": "Desarrollador FrontEnd",
                        "description": "Participé en la primera versión de la administración, brindando una mejor usabilidad en un 10% para los usuarios finales.\nCreé la segunda versión de la administración usando la misma pila de la aplicación web, mejorando la interacción y el despliegue de front-office - back-office . Realicé mejoras en el cliente web, mejorando la usabilidad en un 15% utilizando recursos gráficos más atractivos e intuitivos para el usuario final.\nDesarrollé el módulo de pago del lado del cliente web y del lado de administración para los vendedores.\nDesarrollé el tercero versión de la administración, mejorando la usabilidad del sitio en más del 50% utilizando marcos modernos y mejores prácticas, mejorando más del 50% del tiempo de respuesta del backend, reduciendo la cantidad de solicitudes.\n Líder de equipo front-end."
                    },
                    "backenddev": {
                        "label": "Desarrollador BackEnd",
                        "description": "Mejoré el tiempo de respuesta de la aplicación en más del 50 %, reduciendo la cantidad de volumen de datos innecesarios que se intercambian desde el backend. Mejoré el rendimiento general de la aplicación al aumentar el modelado del sistema de búsqueda e indexación en más del 50 %. Desarrollé el pago sistema que proporciona soluciones a prueba de fallas para un sistema bancario asincrónico. Equipo de back-end Lear, Arquitecto de software, Diseñador de base de datos, Senior"
                    },
                    "devops": {
                        "label": "DevOps",
                        "description": "Ayudé con la configuración del deployment, integración continua, mejoré el rendimiento de la aplicación usando contenedores y balanceadores de carga, mediante el uso de script pude optimizar procesos y acceder a diferentes servicios de terceros"
                    }
                }
            }
        },
        "like": {
            "label": "Gustos"
        },
        "info": {
            "label": "Información",
            "language": {
                "label": "Idioma",
                "es": { "label" : "Español" },
                "en": { "label" : "Inglés" }
            },
            "mode": {
                "label": "Tema",
                "dark": { "label": "Oscuro" },
                "light": { "label": "Claro" }
            }
        }
    }
}